{
  "EmailNotExists": "Email you entered not registered in the system.Please reach out to system admin to get your email registered.",
  "EmailUserNameAlreadyExists": "User with given email already exists",
  "AppSettingAlreadyExists": "Setting with give key already exists",
  "InvalidToken": "Invalid token details",
  "InvalidPassword": "You have entered a wrong password.You have [AttemptLeft] more attempt left before your account will be temporarily locked.If you have forgotten your password, use the 'Forgot Password' option to reset it",
  "InactiveUserAccount": "Your account is currently in disabled state. Please contact system administrator for assistance.",
  "LockedUserAccount": "Your account has been locked. Please contact your system administrator to unlock your account or use the password reset option.",
  "UserAccountLockedDueToFailedAttamps": "Your account has been temporarily locked due to four consecutive failed login attempts. Please contact your system administrator to unlock your account or use the password reset option.",
  "InvalidUserName": "Email you entered doesn't exists in the system.Please reach out to system admin to get your email registered.",
  "PasswordResetLinkLimitReached": "You have reached the limit of maximum 3 attampts for the day.Please try again after sometime.",
  "IssueSendingEmail": "We are facing issues while sending emails please try again sometime later.",
  "CategoryKeyAlreadyExists": "Category with give key already exists",
  "DepartmentPermissionsExists": "Department can't be deleted as it is used by permissions.Please remove permissions for department and try again",
  "DepartmentUsersExists": "Department can't be deleted as it has existing users associated",
  "FieldNameAlreadyExists": "Field with given name already exists",
  "SelectRoleOrDepartment": "Please select either role or department",
  "SelectEitherRoleOrDepartment": "Please select either role or department.Both are not allowed",
  "SelectAtleastOneAction": "Please select atlease one action",
  "PropertyValueAlreadyExists": "Value already exists",
  "SearchWithNameAlreadyExists": "Search with same name already exists please modify the name and try again",
  "SearchAcrossBranchCantEdited": "You cannot edit this shared search.Shared search can be edited within its parent branch only",
  "OtherUserSearchDelete": "Search belongs to other user and can't be deleted",
  "ScreenWithNameAlreadyExists": "Screen with given name already exists",
  "ThreadIdRequired": "Threadid is required",
  "InternalServerError": "An error occurred. Please try again later.",
  "PasswordResetLinkExpired": "The link you are using seems to be expired.Please request a new link by going to Forgot Password screen.",
  "PermissionDenied": "Seems like you don't have permissions to perform this action. Please contact system administrator for assistance.",
  "TagInUseDeleteNotAllowed": "Tag you are trying to delete is associated with orders right now.Please remove the tag from orders and try again.",
  "RoleInUseDeleteNotAllowed": "Role you are trying to delete is associated with one or more users or permissions.Please remove it from all users and permissions and try again.",
  "TaxRateInUseDeleteNotAllowed": "Tax rate you are trying to delete is associated with customers right now.Please remove the tax rate from customers and try again.",
  "SystemRoleModificationNotAllowed": "The role you are trying to update/delete is a system role and can not be changed",
  "DefaultTaxRateAlreadyExists": "Another tax rate marked as default tax rate already exists in the system.",
  "OrderLineItemRequired": "Atleast one line item is required",
  "OnlyInvoicedOrdersCopy": "Only orders with invoiced tag can be copied",
  "OrderThresholdReached": "This order can not be saved. The total amount exceeds the configured threshold price of $[ThreasholdAmount]. Please adjust the amount and try again.",
  "OrderInprogressRequiredFields": "Please complete required fields (i.e Account Manager,Payable amount,Shipping Address,Due Date,Referred By) before moving order to In Progress status"
}